SkyRocketToys/STM8TX/lib/beken.c
	// Clear the bits
	SPI_Write_Reg((BK_WRITE_REG|BK_STATUS), (BK_STATUS_MAX_RT | BK_STATUS_TX_DS | BK_STATUS_RX_DR));
}

// ----------------------------------------------------------------------------
static bool isDisconnected(void)
{
	if (beken.fcc.test_mode)
		return false;
	return (beken.stats.lastTelemetryPktTime == 0) || (timer_get_ms() > beken.stats.lastTelemetryPktTime + 1000);
}

// ----------------------------------------------------------------------------
// Update a radio control packet
// Called from IRQ context
void UpdateTxData(void)
{
	static uint8_t txInfo = 0;
	uint16_t val;
	packetFormatTx* tx = &beken.pktDataTx;

	// Base values for this packet type
	tx->packetType = isDisconnected() ? BK_PKT_TYPE_CTRL_LOST : BK_PKT_TYPE_CTRL_FOUND; ///< The packet type
//	tx->channel;
	tx->u.ctrl.lsb = 0;
	tx->u.ctrl.buttons_held = get_buttons_held();
	tx->u.ctrl.buttons_toggled = get_buttons_toggled();
	tx->u.ctrl.data_type = 0;
	tx->u.ctrl.data_value_lo = 0;
	tx->u.ctrl.data_value_hi = 0;

	// Put in the stick values
	val = channel_value(0);
	tx->u.ctrl.throttle = val >> 2;
	tx->u.ctrl.lsb |= (val & 3) << 0;
	val = channel_value(1);
	tx->u.ctrl.roll = val >> 2;
	tx->u.ctrl.lsb |= (val & 3) << 2;
	val = channel_value(2);
	tx->u.ctrl.pitch = val >> 2;
	tx->u.ctrl.lsb |= (val & 3) << 4;
	val = channel_value(3);
	tx->u.ctrl.yaw = val >> 2;
	tx->u.ctrl.lsb |= (val & 3) << 6;

	// Put in the extra data fields
	if (++txInfo >= INFO_MAX)
		txInfo = 1;
	val = gFwInfo[txInfo];
	tx->u.ctrl.data_type = txInfo;
	tx->u.ctrl.data_value_lo = val & 0xff;
	tx->u.ctrl.data_value_hi = (val >> 8) & 0xff;
}

// ----------------------------------------------------------------------------
void UpdateTxBindData(void)
{
	packetFormatTx* tx = &beken.pktDataTx;

	tx->packetType = BK_PKT_TYPE_BIND;
//	tx->channel;
	tx->u.bind.bind_address[0] = beken.RX0_Address[0];
	tx->u.bind.bind_address[1] = beken.RX0_Address[1];
	tx->u.bind.bind_address[2] = beken.RX0_Address[2];
	tx->u.bind.bind_address[3] = beken.RX0_Address[3];
	tx->u.bind.bind_address[4] = beken.RX0_Address[4];
	tx->u.bind.hopping = 0;
}

// ----------------------------------------------------------------------------
// Prepare to send a FCC packet
static void UpdateFccScan(void)
{
	// Support scan mode
    if (beken.fcc.scan_mode) {
        beken.fcc.scan_count++;
        if (beken.fcc.scan_count >= 200) {
            beken.fcc.scan_count = 0;
            beken.fcc.channel += 2; // Go up by 2Mhz
            if (beken.fcc.channel >= CHANNEL_FCC_HIGH) {
                beken.fcc.channel = CHANNEL_FCC_LOW;
            }
        }
    }
}

// ----------------------------------------------------------------------------
/** From the main thread, we must check to see if (slow) parameter changes are needed */
bool CheckUpdateFccParams(void)
{
	bool result = false;
	if (beken.fcc.test_mode)
	{
		// Set the power
		if (beken.lastTxPower != beken.fcc.power) {
			BK2425_SetTxPower(beken.fcc.power);
			result = true;
		}

		// Set CW mode
		if (beken.fcc.CW_mode != beken.lastTxCwMode) {
			BK2425_SetCarrierMode(beken.fcc.CW_mode);
			result = true;
		}
	}
	return result;
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on timer interrupts for the Beken chip */
void beken_timer_irq(void)
{
	static uint8_t txChannel = 0;
	static uint8_t bindTimer = 0;
	// No need for this as caller takes care of it:
	// TIM4->SR1 = (uint8_t)(~TIM4_IT_UPDATE);
	if (!bkReady) // We are reinitialising the chip in the main thread
		return;

	// Change to the next (non-ignored) channel
	if (beken.fcc.test_mode)
	{
		UpdateFccScan();
		BK2425_ChangeChannel(beken.fcc.channel);
		txChannel = 0;
	}
	else
	{
		txChannel = NextChannelIndex(txChannel);
		BK2425_ChangeChannel(LookupChannel(txChannel));
	}
	FlushTx(); // Discard any buffered tx bytes
	BK2425_ClearAckOverflow();

	// Support sending binding packets
	if (isDisconnected())
	{
		if (++bindTimer >= 7)
		{
			bindTimer = 0;
			BK2425_SwitchToIdleMode();
			ChangeAddressTx(1); // Binding address
			BK2425_SwitchToTxMode();
			UpdateTxBindData();
			beken.pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
			beken.lastTxChannel = txChannel;
			Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&beken.pktDataTx, PACKET_LENGTH_TX_BIND);
			return;
		}
		else if (bindTimer == 0)
		{
			BK2425_SwitchToIdleMode();
			ChangeAddressTx(0); // Unique address for this controls
		}
	}
	else if (bindTimer != 99)
	{
		bindTimer = 99;
		BK2425_SwitchToIdleMode();
		ChangeAddressTx(0); // Unique address for this controls
	}
	BK2425_SwitchToTxMode();
	UpdateTxData();
	beken.pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
	beken.lastTxChannel = txChannel;
	beken.stats.lastTxPacketCount++;
	if (!beken.lastTxCwMode)
		Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&beken.pktDataTx, PACKET_LENGTH_TX_CTRL);
}

// ----------------------------------------------------------------------------
/** Start sending a binding packet */
void beken_start_bind_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending a control data packet */
void beken_start_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an FCC test packet */
void beken_start_FCC_test(void)
{
    beken.fcc.channel = CHANNEL_FCC_LOW;
    beken.fcc.power = 7;
    beken.fcc.test_mode = true;
}

// ----------------------------------------------------------------------------
/** Start sending an factory test packet */
void beken_start_factory_test(
	uint8_t test_mode) ///< The type of test to send.
{
	//...
}

// ----------------------------------------------------------------------------
/** Set the next FCC power */
void beken_next_FCC_power(void)
{
    beken.fcc.power = (beken.fcc.power+1) & 7;
}

// ----------------------------------------------------------------------------
/** Go into continuous carrier wave send mode or normal mode */
void beken_set_CW_mode(
	bool cw) ///< false=normal, true=carrier wave
{
    beken.fcc.CW_mode = cw;
}

// ----------------------------------------------------------------------------
/** Change the FCC channel */
void beken_change_FCC_channel(
	int8_t change) ///< ?
{
    switch (beken.fcc.channel) {
    case CHANNEL_FCC_LOW:
        beken.fcc.channel = change==1?CHANNEL_FCC_MID:CHANNEL_FCC_HIGH;
        break;
    case CHANNEL_FCC_MID:
        beken.fcc.channel = change==1?CHANNEL_FCC_HIGH:CHANNEL_FCC_LOW;
        break;
    default:
    case CHANNEL_FCC_HIGH:
        beken.fcc.channel = change==1?CHANNEL_FCC_LOW:CHANNEL_FCC_MID;
        break;
    }
}

// ----------------------------------------------------------------------------
/** Toggle the FCC scan */
void beken_FCC_toggle_scan(void)
{
	beken.fcc.scan_mode = !beken.fcc.scan_mode;
    if (!beken.fcc.scan_mode) {
        beken.fcc.channel = CHANNEL_FCC_LOW;
    }
}

// ----------------------------------------------------------------------------
/** Get the current tx power (for debug output) */
uint8_t get_tx_power(void)
{
	return beken.lastTxPower;
}

// ----------------------------------------------------------------------------
/** Get the current FCC channel */
int8_t get_FCC_chan(void)
{
	if (beken.fcc.test_mode)
		return beken.fcc.channel;
	return -1; // We are not in fcc mode
}

// ----------------------------------------------------------------------------
/** Get the current FCC power */
uint8_t get_FCC_power(void)
{
	if (beken.fcc.test_mode)
		return beken.fcc.power;
	return 0;
}

#if 0
uint8_t get_telem_pps(void)
{
    return 0;
}

void radio_set_pps_rssi(void)
{
}

#endif

/** @}*/

#endif
